---
kind: type
id: T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
source: html/b93d3383-21af-d252-06ff-9d0ed7f75ea9.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs

The event arguments used by the ExternalDataInstanceAddedInto event.

## Syntax (C#)
```csharp
public class ExternalDataInstanceAddedIntoDocumentEventArgs : RevitAPIPostDocEventArgs
```